"""
打印一个正方形的星号
1、打印一个星星
2、一行5个星星
3、打印5行星星
"""


i = 1
while i <= 5:
    # 一行星星开始
    j = 1
    while j <= 5:
        print("*", end='\t')
        j += 1
    # 一行星星结束，并换行显示
    print()
    i += 1
print("------------------------------", end='\n\n')

"""
打印一个三角形星号
1、每行星星的个数和行号相同
"""

j = 0
while j < 5:
    i = 0
    while i < j+1:
        print("*", end='\t')
        i += 1
    print()
    j += 1

print("------------------------------", end='\n\n')

# 实现九九乘法表

j = 1
while j <= 9:
    i = 1
    while i <= j:
        print(f'{i} * {j} = {i*j}', end='\t')
        i += 1
    print()
    j += 1
